
* Prequisites

  - Emacs (26.1, May 2018)
  - Org mode 9 (9.1.13, May 2018)
  - G++ (8.x, for C++17 support; older versions are fine otherwise)

** Suggested Configuration

   ~ob-C~ and ~ob-shell~ are the bare minimum. Once you get the hang of
   this, you will want more... The relevant section in my ~init.el~ reads:

   #+BEGIN_EXAMPLE
   (setq org-src-fontify-natively t
         org-src-tab-acts-natively t
         org-confirm-babel-evaluate nil
         ob-async-no-async-languages-alist '("ipython")
         org-edit-src-content-indentation 0)

   (require 'ob-C)
   (require 'ob-async)
   (require 'ob-ipython)
   (require 'ob-lisp)
   (require 'ob-org)
   (require 'ob-python)
   (require 'ob-shell)

   (org-babel-do-load-languages
    'org-babel-load-languages
    '((C . t)
      (emacs-lisp . t)
      (gnuplot . t)
      (ipython . t)
      (python . t)
      (lisp . t)
      (shell . t)))
   #+END_EXAMPLE


* Get This

  Go ahead and place the cursor inside the source code block below,
  and hit ~C-c C-c~ ! If your installation/configuration adds up, the output
  shouldn't surprise you.

  #+HEADERS: :includes <iostream> :namespaces std
  #+BEGIN_SRC C++ :results output :tangle yes
  cout << "Hello, scripting world!\n";
  #+END_SRC

  #+RESULTS:
  : Hello, scripting world!

  Create a full C++ program by tangling the source block: Place the cursor
  inside the source block and hit ~C-c C-v t~. ~hello.cpp~ will be created next
  to this Org file.

* References
  
  - [[https://orgmode.org/][Org mode for Emacs]]
  - [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-C.html][C, C++, D Source Code Blocks in Org Mode]]
  - [[http://ehneilsen.net/notebook/orgExamples/org-examples.html][Emacs org-mode examples and cookbook]]
  - [[https://www.wisdomandwonder.com/article/10597/remove-every-source-block-results][Remove Every Source Block Results]]
